# American Housing Survey (2017)

Use this [table key](https://www.census.gov/data-tools/demo/codebook/ahs/ahsdict.html?s_year=2017&s_topic=40EB020630AA1409581A967631144B46,20C2F713088C73BC8C9BE4A2990B040A,D18F3B39611802F0564BD762BAF99B2D,F97310F1003D402DF4FAED1A1FAC3D2A&s_searchvalue=) to search for and understand data!

In [ ]:
ahs_2017 = "ahs_2017"

In [2]:
!bq --location=US mk --dataset {ahs_2017}

BigQuery error in mk operation: Dataset 'sashimi-266523:ahs_2017' already
exists.

## Load data from bucket and csv file to create table: person, mortage, project

In [7]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {ahs_2017}.person \
'gs://ahs-2017/person.csv'

Waiting on bqjob_r264da81ab7c8fba3_00000170139beb60_1 ... (23s) Current status: DONE

In [9]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {ahs_2017}.mortgage \
'gs://ahs-2017/mortgage.csv'

Waiting on bqjob_r5737f4262a25afe8_00000170139d50c2_1 ... (3s) Current status: DONE

In [10]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {ahs_2017}.project \
'gs://ahs-2017/project.csv'

Waiting on bqjob_r76d3cc29e792ab92_00000170139db77f_1 ... (15s) Current status: DONE

## Some basic info

### Household

In [15]:
%%bigquery
select MARKETVAL,TOTROOMS from ahs_2017.household 
order by MARKETVAL desc 
limit 100

    MARKETVAL  TOTROOMS JDISHH
0     9999998        10    '0'
1     9999998        11    '0'
2     9999998        10    '0'
3     9999998         9    '0'
4     9999998         4    '0'
..        ...       ...    ...
95    4693050         8    '0'
96    4670837        12    '0'
97    4624715         3    '0'
98    4620781         8    '0'
99    4551825         9    '0'

[100 rows x 3 columns]

### Person

In [17]:
%%bigquery
select SEX, AGE, RACE, GRAD, CITSHP, NATVTY from ahs_2017.person
order by Age desc
limit 100

    SEX  AGE  RACE  GRAD CITSHP NATVTY
0   '2'   85  '01'  '37'    '1'  '057'
1   '2'   85  '01'  '39'    '1'  '057'
2   '1'   85  '01'  '36'    '1'  '057'
3   '1'   85  '01'  '31'    '1'  '057'
4   '2'   85  '01'  '39'    '1'  '057'
..  ...  ...   ...   ...    ...    ...
95  '2'   85  '01'  '41'    '1'  '057'
96  '2'   85  '02'  '40'    '1'  '057'
97  '1'   85  '02'  '35'    '1'  '057'
98  '2'   85  '02'  '44'    '1'  '057'
99  '1'   85  '01'  '46'    '1'  '057'

[100 rows x 6 columns]